package message
{

    public class MessageList extends Object
    {
        public static var aMessage:Object = [{id:495, mess:"倉庫内の未受取件数が９００件を超えています。\n１０００件を超えるアイテムを獲得した場合は\n古いアイテムから削除されます。"}, {id:1811, mess:"部隊内に同じ家臣がいるため\nコマンダースキルが無効"}, {id:1812, mess:"部隊の人数が足りません\n"}, {id:1813, mess:"コマンダーを設定してください"}, {id:2682, mess:"出撃部隊にコマンダーを\n設定できるようになったよ！\n早速、作戦本部に行ってみよう！"}, {id:2926, mess:"出撃部隊が全員、成長限界に達しています。\nこれ以上成長させることができないため\n%sは使用できません。\n"}, {id:2927, mess:"出撃部隊に%sの効果が有効な対象が\nいないため使用できません。"}, {id:4351, mess:"期限あり"}, {id:4352, mess:"期限なし"}, {id:4691, mess:"カムバック褒賞で獲得"}, {id:6881, mess:"コマンダーのみの部隊では出撃できません。\n作戦本部で部隊を編成してください。"}, {id:6882, mess:"部隊の人数が６人未満の為、\nコマンダーは出撃できません。\nこのまま出撃してよろしいですか？"}, {id:6903, mess:"贈り物"}, {id:7121, mess:"出撃可能な部隊が編成されていません。"}, {id:7401, mess:"建設終了まで"}, {id:7402, mess:"この施設は建設中です。"}, {id:8941, mess:"コマンダースキルを持った家臣をコマンダーに設定しよう！\n出撃前ならいつでも自由にコマンダーを変更できるよ！"}, {id:8942, mess:"コマンダーはコマンダースキルで部隊をサポートしたり\n部隊の人数が減ると、自動的に戦闘に参加したりするんだ。\n作戦に合わせて、いろんな編成を試してみよう！"}, {id:10330, mess:"報酬確認"}, {id:20091, mess:"受取済み"}, {id:20120, mess:"デイリーミッションは１日１回挑戦できる\n日替わり任務だよ。\n毎日連続でクリアすることで\n難易度が上がるミッションもあるみたい。"}, {id:2180010, mess:"家臣"}, {id:2180020, mess:"モンスターの討伐に協力"}, {id:2180030, mess:"協力"}, {id:2180040, mess:"遊牧"}, {id:2180050, mess:"討伐"}, {id:2180060, mess:"生活を脅かす"}];

        public function MessageList()
        {
            return;
        }// end function

    }
}
